unit ToDO;

{

30. Artyomka  09.11.2003, 19:31 
 
Не хватает:
1) кнопочек на архив общий, например посмотреть архив за то время, когда тебя не было в чате, или другой камеры- необходимо лезть в "Замок" через браузер.
<done> 2) линк с кнопочки "администрирование" сделать на castle.istu.edu/admin в новом окне.
<done> 3) на 98-ой винде смайлики выводятся просто как картинки, ни линка, ни как писать нет.
<done> 5) переход между камерами (в т.ч. и с доступом в хмурую, карцер, тимус тем, у кого есть этот доступ)
<done> 6) часов! Иногда удобно ориентироваться на время сервера, чем чужого компа.
<done> 7) перекодировки рус/лат
<done 70%> 8) автозаполнения в поле ввода сообщения.
<сделать сохранение введенных сообщений>

эта...
два недостатка, обнаруженных за 10 минут использования:
1. При просмотре архива на опредленного пользователя, то нет возможности просмотреть полностью сообщение, разве что скопировав его при помомщи подсказки Ctrl-C и вставив в тот же нотпад.

VampЫr: я так думаю, что вообще лучше сделать еще одну кнопочку в меню, это список заключенных по камерам...... удобно будет.....


2. при отправке сообщения открывается только при заходе след. раз. Если юзер сидит в чате, он посмотреть его не может. Аттач
<done> 3. С блокировкой разберись!
4. Добавляй справку, в кот. расписаь гор. клавиши и удобства.
5. При отсутствии сети, а потом появляется - диалог не восстанавливался у меня, приходилось выходить из него, и заново заходить
<done>6. память сообщений ведённых нужна и из предыдущих сеансов, а не только текущего.
7. Второй аттач: ник Shershavy - белый, а так его вообще не видно
8. Третий аттач: сообщения на никазх саватарками в стиле "Клиента" не красятся красным.
9. Мессаги администратора и стражника в стилях "Клиента выделить бы как нибудь цветом, не только курсивом)
10. На 98-ой надо потестировать, работает ли ява при клике на ники, при вкл. винампе, какой то там косяк был.
11. Под провайдером "ИркутскЭнергоСвязь" клиент работать не захотел (ещё на 98-ой тестил), ошибку выдавал.
12. нужны кнопки из замка: список камер, хелп, правила чата, архив чата (общий), список камер.

п.с. тестирую уже на 2000-ой. 98ую снёс на хрен.

Настройки новые понравились!

1. На входе выпадающего меню с никами ранее введёнными хотелось бы
2. приколюха, но не прописывать её возможности:
   в одном чате локальном была фишка: можно было постить хоть стихи,
   при переключении (там была горячей ф4) поле ввода увеличивалось и
   можно было вставлять абзацы, выводилось в чат это всё каждая
   строчка - 1 сообщение.
   флудить будут, но фенечка забавная
3. Картинок побольше бы типа таракана, главное прикольных надо !

}

interface

implementation

end.
 